enum LocationList {
  area1('도쿄', '신주쿠', 35.6929127999999, 139.709008, 1),
  area2('도쿄', '시부야', 35.6603981, 139.7051782, 2),
  area3('도쿄', '긴자', 35.6759901, 139.7725008, 3),
  area4('도쿄', '우에노', 35.7087296, 139.7741538, 4),
  area5('도쿄', '오다이바', 35.6205834, 139.7805445, 5),
  area6('도쿄', '아사쿠사', 35.7185858, 139.7958849, 6),
  area7('도쿄', '롯폰기', 35.6618586, 139.7345469, 7),
  area8('도쿄', '하코네', 35.2323825, 139.1069355, 8),
  area9('도쿄', '요코하마', 35.4436739, 139.6379639, 9),
  area10('도쿄', '가마쿠라', 35.3192128, 139.5466731, 10),
  area11('간사이', '교토', 35.011564, 135.7681489, 11),
  area12('간사이', '난바', 34.6657531, 135.5010362, 12),
  area13('간사이', '우메다', 34.7005588, 135.4957339, 13);
  // area14('도쿄', '신주쿠'),
  // area15('도쿄', '신주쿠'),
  // area16('도쿄', '신주쿠'),
  // area17('도쿄', '신주쿠');

  final String bigArea;
  final String smallArea;
  final double latitude;
  final double longitude;
  final int areaNum;
  const LocationList(this.bigArea, this.smallArea, this.latitude,
      this.longitude, this.areaNum);
}
